CSI API ETABS v1

# cFunctionFuncRS Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cFunctionRS FuncRS { get; }

    ReadOnly Property FuncRS As cFunctionRS
    	Get

    Dim instance As cFunction
    Dim value As cFunctionRS

    value = instance.FuncRS

    property cFunctionRS^ FuncRS {
    	cFunctionRS^ get ();
    }

    abstract FuncRS : cFunctionRS with get

#### Property Value

Type: cFunctionRS

See Also

#### Reference

cFunction Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com